Tekla Open API Reference for Tekla Structures 2025
Angle.UnitType Enumeration
 The angle units.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum UnitType
Public Enumeration UnitType
Members
Member name | Value | Description
Degrees | 0 |  Represents an angle in degrees, with 0 degrees representing the empty angle and 360 the full angle
Radians | 1 |  Represents an angle in radians, with 0 radians representing the empty angle and 2*PI the full angle
See Also
Reference
Tekla.Structures.Datatype Namespace